# MechanicalFitting Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalFitting Properties
MechanicalFitting Class See Also
---
The MechanicalFitting type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectorManager | Retrieves the Connector Manager from this MEPModel.  (Inherited from MEPModel.) |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from MEPModel.) |
| PartType | The part type of the mechanical fitting. |

# See Also
MechanicalFitting Class
Autodesk.Revit.DB.Mechanical Namespace